Documents/Renault_ЗапросНаКоммерческуюПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ЗапросНаКоммерческуюПомощь</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ОснованияЗапросаНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбращениеКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОбращениеКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросДилераСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатныеРемонты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажиАвто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращенияВДЦ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РепутационныеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическиеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистРено</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрохождениеТО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПрохождениеТО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДопОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешенияПоГарантийнымРасценкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешенияПоКоммерческимРасценкам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендованнаяКоммерческаяПомощь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостояниеЗапросаНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CaseNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CaseStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DATE_MODIFIED</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОщущениеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ОщущенияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяСистемаАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемныеСистемыАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиICM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеСТекЛайн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланиеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПожеланияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРекомендованноцКоммерческойПомощи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоментарийПричинаУвелеченияСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateResolved</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияДосье</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияДосье</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/Renault_СостояниеЗапросаНаКоммерческуюПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СостояниеЗапросаНаКоммерческуюПомощь</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаДилером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаРассмотренииSRC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжиданииОтветаДилера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Одобрено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОдобрено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ЗапросНаКоммерческуюПомощь/Forms/ФормаСпискаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Отбор = Истина;
	Статус = ПолучитьСтатусПоСтранице (ТекущаяСтраница);
	
	Если ТекущаяСтраница = Элементы.ГруппаВсе Тогда
		Отбор = Ложь;
	КонецЕсли;
	
	ОбновитьЗапросСписка (Отбор, Статус);
	УстановитьЗаголовки();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтатусПоСтранице (ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаВсе Тогда
		Статус = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ПустаяСсылка();
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаОтправлен Тогда
		Статус = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросОтправлен;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаРассмотрении Тогда
		Статус = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросНаРассмотренииSRC;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаОжидание Тогда
		Статус = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ВОжиданииОтветаДилера;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаОдобренно Тогда
		Статус = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Одобрено;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаНеодобрено Тогда
		Статус = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.НеОдобрено;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаЗакрыто Тогда
		Статус = Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Закрыто; 
	КонецЕсли;
	Возврат Статус;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапроса ()
	
	Возврат "ВЫБРАТЬ
	|	Renault_ЗапросНаКоммерческуюПомощь.Ссылка,
	|	Renault_ЗапросНаКоммерческуюПомощь.Номер,
	|	Renault_ЗапросНаКоммерческуюПомощь.Дата,
	|	Renault_ЗапросНаКоммерческуюПомощь.Контрагент,
	|	Renault_ЗапросНаКоммерческуюПомощь.Автомобиль,
	|	Renault_ЗапросНаКоммерческуюПомощь.ПричинаОбращения,
	|	Renault_ЗапросНаКоммерческуюПомощь.ЗапросДилераСумма,
	|	Renault_ЗапросНаКоммерческуюПомощь.Комментарий,
	|	Renault_ЗапросНаКоммерческуюПомощь.CaseNumber,
	|	Renault_ЗапросНаКоммерческуюПомощь.CaseStatus,
	|	Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса,
	|	Renault_ЗапросНаКоммерческуюПомощь.DateResolved,
	|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(Renault_ЗапросНаКоммерческуюПомощь.Дата, Renault_ЗапросНаКоммерческуюПомощь.DateResolved, ДЕНЬ) КАК ЧИСЛО(15, 2)) КАК DateResolvedAlert
	|ИЗ
	|	Документ.Renault_ЗапросНаКоммерческуюПомощь КАК Renault_ЗапросНаКоммерческуюПомощь";
	
КонецФункции

&НаСервере
Процедура ОбновитьЗапросСписка (Отбор, Статус)
	ТекстЗапроса = ПолучитьТекстЗапроса();
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Если Отбор Тогда
		ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
		ОтборЗапрос = ПакетЗапросов.Операторы[0].Отбор;
		ОтборЗапрос.Добавить("Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса = &СтатусЗапроса");
	КонецЕсли; 
	Если ФлажокОткрытия Тогда
		ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
		ОтборЗапрос = ПакетЗапросов.Операторы[0].Отбор;
		ОтборЗапрос.Добавить("Renault_ЗапросНаКоммерческуюПомощь.ДатаОткрытияДосье >= &ДатаНачала");
		ОтборЗапрос.Добавить("Renault_ЗапросНаКоммерческуюПомощь.ДатаОткрытияДосье <= &ДатаОкончания");
	КонецЕсли;
	Если ФлажокЗакрытия Тогда
		ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
		ОтборЗапрос = ПакетЗапросов.Операторы[0].Отбор;
		ОтборЗапрос.Добавить("Renault_ЗапросНаКоммерческуюПомощь.ДатаЗакрытияДосье >= &ДатаНачала");
		ОтборЗапрос.Добавить("Renault_ЗапросНаКоммерческуюПомощь.ДатаЗакрытияДосье <= &ДатаОкончания");
	КонецЕсли;
	Список.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	Если Отбор Тогда
		Список.Параметры.УстановитьЗначениеПараметра("СтатусЗапроса", Статус);
	КонецЕсли;
	Если ФлажокОткрытия Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодОткрытия.ДатаНачала);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодОткрытия.ДатаОкончания);
	КонецЕсли;
	Если ФлажокЗакрытия Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодЗакрытия.ДатаНачала);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодЗакрытия.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовки ()
	ТекстЗапроса = ПолучитьТекстЗапроса();
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	сОтбор = Новый Структура;
	Элементы.ГруппаВсе.Заголовок = "Все запросы (" + ПросчитатьКоличествоЛидов(СхемаЗапроса.ПолучитьТекстЗапроса(), сОтбор)+")";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	Отбор = ПакетЗапросов.Операторы[0].Отбор;
	сОтбор = Новый Структура;
	сОтбор.Вставить("СтатусЗапроса", Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросОтправлен);
	Отбор.Добавить("Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса = &СтатусЗапроса");
	Элементы.ГруппаОтправлен.Заголовок = "Запрос отправлен (" + ПросчитатьКоличествоЛидов(СхемаЗапроса.ПолучитьТекстЗапроса(), сОтбор)+")";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	Отбор = ПакетЗапросов.Операторы[0].Отбор;
	сОтбор = Новый Структура;
	сОтбор.Вставить("СтатусЗапроса", Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ЗапросНаРассмотренииSRC);
	Отбор.Добавить("Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса = &СтатусЗапроса");
	Элементы.ГруппаРассмотрении.Заголовок = "Запрос на рассмотрении (" + ПросчитатьКоличествоЛидов(СхемаЗапроса.ПолучитьТекстЗапроса(), сОтбор)+")";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	Отбор = ПакетЗапросов.Операторы[0].Отбор;
	сОтбор = Новый Структура;
	сОтбор.Вставить("СтатусЗапроса", Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.ВОжиданииОтветаДилера);
	Отбор.Добавить("Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса = &СтатусЗапроса");
	Элементы.ГруппаОжидание.Заголовок = "В ожидании ответа от дилера (" + ПросчитатьКоличествоЛидов(СхемаЗапроса.ПолучитьТекстЗапроса(), сОтбор)+")";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	Отбор = ПакетЗапросов.Операторы[0].Отбор;
	сОтбор = Новый Структура;
	сОтбор.Вставить("СтатусЗапроса", Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Одобрено);
	Отбор.Добавить("Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса = &СтатусЗапроса");
	Элементы.ГруппаОдобренно.Заголовок = "Одобрено (" + ПросчитатьКоличествоЛидов(СхемаЗапроса.ПолучитьТекстЗапроса(), сОтбор)+")";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	Отбор = ПакетЗапросов.Операторы[0].Отбор;
	сОтбор = Новый Структура;
	сОтбор.Вставить("СтатусЗапроса", Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.НеОдобрено);
	Отбор.Добавить("Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса = &СтатусЗапроса");
	Элементы.ГруппаНеодобрено.Заголовок = "Неодобрено (" + ПросчитатьКоличествоЛидов(СхемаЗапроса.ПолучитьТекстЗапроса(), сОтбор)+")";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	Отбор = ПакетЗапросов.Операторы[0].Отбор;
	сОтбор = Новый Структура;
	сОтбор.Вставить("СтатусЗапроса", Перечисления.Renault_СостояниеЗапросаНаКоммерческуюПомощь.Закрыто);
	Отбор.Добавить("Renault_ЗапросНаКоммерческуюПомощь.СтатусЗапроса = &СтатусЗапроса");
	Элементы.ГруппаЗакрыто.Заголовок = "Закрытые (" + ПросчитатьКоличествоЛидов(СхемаЗапроса.ПолучитьТекстЗапроса(), сОтбор)+")";

КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПросчитатьКоличествоЛидов (ТекстЗапроса, сПараметры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Для Каждого Параметр из сПараметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ.Количество();
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьЗаголовки();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок ()
	
	Отбор = Истина;
	ТекущаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	Статус = ПолучитьСтатусПоСтранице (ТекущаяСтраница);
	
	Если ТекущаяСтраница = Элементы.ГруппаВсе Тогда
		Отбор = Ложь;
	КонецЕсли;
	
	ОбновитьЗапросСписка (Отбор, Статус);
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокОткрытияПриИзменении(Элемент)
	ОбновитьСписок ();
КонецПроцедуры

&НаКлиенте
Процедура ФлажокЗакрытияПриИзменении(Элемент)
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗакрытияПриИзменении(Элемент)
	Если ФлажокЗакрытия Тогда
		ОбновитьСписок();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодОткрытияПриИзменении(Элемент)
	Если ФлажокОткрытия Тогда
		ОбновитьСписок();
	КонецЕсли;
КонецПроцедуры
